#pragma once
#include <Windows.h>

enum en_PACKET_TYPE : WORD
{
	en_PACKET_CS_CHAT_SERVER = 0,

	//------------------------------------------------------------
	// 채팅서버 로그인 요청
	//
	//	{
	//		WORD	Type
	//
	//		WCHAR	Nickname[20]		// null 포함
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_LOGIN,

	//------------------------------------------------------------
	// 채팅서버 로그인 응답
	//
	//	{
	//		WORD	Type
	//
	//		BYTE	Result				(1:OK / 2:중복닉네임 / 3:사용자초과 / 4:기타오류)
	//		OK시에만 아래 정보 포함
	//		UINT	AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_LOGIN,

	//------------------------------------------------------------
	//	방 리스트 요청
	//	
	// {
	//		WORD	Type
	// }
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_ROOM_LIST,

	//------------------------------------------------------------
	//	방 리스트 응답
	//	
	// {
	//		WORD	Type
	//
	//		WORD	RoomCount
	//		{
	//			INT		RoomNo
	//			WORD	RoomName Size
	//			WCHAR	RoomName[RoomName Size / 2]
	//			BYTE	UserCount
	//			{
	//				WCHAR[20] NickName
	//			}
	//		}
	// }
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROOM_LIST,

	//------------------------------------------------------------
	//	대화방 생성 요청
	//	
	//	{
	// 		WORD	Type
	//		
	//		WORD	RoomNameLen
	//		WCHAR	RoomName[RoomNameLen / 2]
	//	}
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_ROOM_CREATE,

	//------------------------------------------------------------
	//	대화방 생성 응답
	//
	//	{
	//		WORD	Type
	//
	//		BYTE	ResultCode		(1:OK / 2:방이름 중복 / 3:개수초과 / 4:기타오류)
	//		OK시에만 아래 정보 포함
	//		INT		RoomNo
	//		WORD	RoomNameLen
	//		WCHAR	RoomName[RoomNameLen / 2]
	//	}
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROOM_CREATE,

	//------------------------------------------------------------
	// 방 입장 요청
	//
	//	{
	//		WORD	Type
	//
	//		INT		RoomNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_ROOM_ENTER,
	
	//------------------------------------------------------------
	// 방 입장 요청 응답
	//
	//	{
	//		WORD	Type
	//
	//		BTYE	ResultCode	결과(1:OK / 2 : 방No 오류 / 3 : 인원초과 / 4 : 기타오류)
	//		OK시에만 아래 정보 포함
	//		INT		RoomNo
	//		WORD	RoomNameLen
	//		WCHAR	RoomName[RoomNameLen / 2]
	//
	//		BYTE	UserCount
	//		{
	//			WCHAR	NickName[20]
	//			UINT	accountNo
	//		}
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROOM_ENTER,

	//------------------------------------------------------------
	// 채팅보내기 요청
	//
	//	{
	//		WORD	Type
	//
	//		WORD	MessageLen
	//		WCHAR	Message[MessageLen / 2]		// null 미포함
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_MESSAGE,

	//------------------------------------------------------------
	// 채팅보내기 응답  (다른 클라가 보낸 채팅도 이걸로 받음)
	//
	//	{
	//		WORD	Type
	//
	//		UINT	AccountNo
	//		
	//		WORD	MessageLen
	//		WCHAR	Message[MessageLen / 2]		// null 미포함
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_MESSAGE,
			   
	//------------------------------------------------------------
	// 방 나가기 요청
	//
	//	{
	//		WORD	Type
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_ROOM_LEAVE,

	//------------------------------------------------------------
	// 방 나가기 응답(수시)
	//
	//	{
	//		WORD	Type
	//
	//		UINT	AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROOM_LEAVE,
	
	//------------------------------------------------------------
	// 방 삭제 (수시)
	//
	//	{
	//		WORD	Type
	//
	//		INT		RoomNo
	//	}
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROOM_DESTORY,

	//------------------------------------------------------------
	// 타 사용자 입장 (수시) 
	//
	//	{
	//		WORD		Type
	//
	//		WCHAR[20]	NickName
	//		UINT		AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_USER_ENTER,

	//------------------------------------------------------------
	//	게임 시작 요청
	//
	//	{
	//		WORD	Type
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_MAFIA_START,
	
	//------------------------------------------------------------
	//	게임 시작 알림
	//
	//	{
	//		WORD	Type
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_MAFIA_START,

	//------------------------------------------------------------
	//	게임 종료 알림
	//
	//	{
	//		WORD	Type
	//
	//		BYTE	WinTeam		(시민:1 / 마피아:4)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_MAFIA_END,

	//------------------------------------------------------------
	//	역할 알림
	//
	//	{
	//		WORD	Type
	//	
	//		BYTE	Role	(시민:1 / 경찰:2 / 의사:3 / 마피아:4)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_ROLE_NOTIFY,

	//------------------------------------------------------------
	//	낮 밤 변화 알림
	//
	//	{
	//		WORD	Type
	//		BYTE	time	(1:낮 / 2:밤)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_TIME_CHANGE,

	//------------------------------------------------------------
	//	투표 시작 알림
	//
	//	{
	//		WORD	Type
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_VOTE_START,

	//------------------------------------------------------------
	//	투표 종료 알림
	//
	//	{
	//		WORD	Type
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_VOTE_END,

	//------------------------------------------------------------
	//	투표 요청
	//
	//	{
	//		WORD	Type
	//		
	//		UINT	AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_VOTE,

	//------------------------------------------------------------
	//	투표 결과 알림
	//
	//	{
	//		WORD	Type
	//
	//		BYTE	Result			(1:정상 / 2:실패)
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_VOTE,

	//------------------------------------------------------------
	//	플레이어 죽음 알림
	//
	//	{
	//		WORD	Type
	//	
	//		UINT	AccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_DIE,

	//------------------------------------------------------------
	//	능력 사용 요청 (마피아 공격 포함)
	//
	//	{
	//		WORD	Type
	//
	//		UINT	TargetAccountNo
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_REQ_USE_ABILITY,

	//------------------------------------------------------------
	//	서버의 브로드캐스트 알림
	//
	//	{
	//		WORD	Type
	//
	//		WORD	MessageLen
	//		WCHAR	Message[MessageLen / 2]
	//	}
	//
	//------------------------------------------------------------
	en_PACKET_CS_CHAT_RES_BROADCAST
	
	//------------------------------------------------------------
	
	//------------------------------------------------------------

};
enum class RES_LOGIN_RESULT_CODE : BYTE
{
	OK				= 1,
	ALREADY_NAME	= 2,
	FULL			= 3,
	ETC				= 4
};
enum class ROOM_CREATE_RESULT_CODE : BYTE
{
	//(1:OK / 2 : 방이름 중복 / 3 : 개수초과 / 4 : 기타오류)
	OK				= 1,
	ALREADY_NAME	= 2,
	FULL			= 3,
	ETC				= 4
};

enum class ROOM_ENTER_RESULT_CODE : BYTE
{
	//(1:OK / 2 : 방이름 중복 / 3 : 개수초과 / 4 : 기타오류)
	OK = 1,
	ROOMNO_ERROR = 2,
	ROOM_FULL = 3,
	ETC = 4
};

enum class VOTE_RESULT_CODE : BYTE
{
	SUCCESS = 1,
	FAILURE = 2
};
typedef RES_LOGIN_RESULT_CODE LOGIN_CODE;
typedef ROOM_CREATE_RESULT_CODE CREATE_CODE;
typedef ROOM_ENTER_RESULT_CODE ENTER_CODE;
typedef VOTE_RESULT_CODE VOTE_CODE;